# FieldTooltip Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CustomFieldData..::..FieldTooltip Property
CustomFieldData Class See Also
---
The tooltip that will be shown in the schedule properties dialog for this custom field.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public string FieldTooltip { get; }
```

Visual Basic
---
```text
Public ReadOnly Property FieldTooltip As String
	Get
```

Visual C++
---
```text
public:
property String^ FieldTooltip {
	String^ get ();
}
```

# See Also
CustomFieldData Class
Autodesk.Revit.DB Namespace